# task 1 : Read SQL file with pandas 
you can check more https://datatofish.com/sql-to-pandas-dataframe/

In [30]:
import pyodbc
import pandas as pd

conn = pyodbc.connect(r'Driver={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=C:\Users\hp\Untitled Folder 1\Database1.accdb;')

SQL_Query = pd.read_sql_query('''select 
name,
age
from test''',conn)
df = pd.DataFrame(SQL_Query, columns=['name','age'])
df

       name  age
0      noor   55
1     Ahmed   40
2       Ali   55
3  Mohammed   66
4      None   99

# task2: change a colum name in pandas

In [8]:
import pandas as pd
df = pd.read_csv("aa.csv")
df

   column  columnn   test
0    30.0     30.0  test1
1     NaN     32.0  test3
2     NaN      NaN    hel
3     NaN      NaN     hi
4    32.0      NaN    no

In [10]:
df = df.rename(columns={'test':'not_a_test'})
df

   column  columnn not_a_test
0    30.0     30.0      test1
1     NaN     32.0      test3
2     NaN      NaN        hel
3     NaN      NaN         hi
4    32.0      NaN        no